app/views/tasks/index.html.erb

SELECT "types".* FROM "types"
---
search by task category
<%= select_tag "type_search", content_tag(:option,'all categories',:value=>"")+options_from_collection_for_select(Type.all, "id", "name") %>

SELECT  "statuses".* FROM "statuses" WHERE "statuses"."id" = ? LIMIT ?  [["id", 31], ["LIMIT", 1]]
---
      <td align="center"><%= task.due_date.try(:strftime,'%d/%m/%Y') %></td>
      <td align="center"><%if task.status.name == "Completed" && task.end_date.present?%>