app/views/tasks/new.html.erb

        <%= form.label :status %>
        <%= form.collection_select(:status_id, Status.all, :id, :name) %>
---
SELECT "statuses".* FROM "statuses"

        <%= form.label :priority %>
        <%= form.collection_select(:priority_id, Priority.all, :id, :name) %>
---
SELECT "priorities".* FROM "priorities"

        <%= form.label :category %>
        <%= form.collection_select(:type_id, Type.all, :id, :name) %>
---
SELECT "types".* FROM "types"