app/views/tasks/new.html.erb

SELECT "statuses".* FROM "statuses"
---
    <%= form.label :status %><br>
    <%= form.collection_select(:status_id, Status.all, :id, :name) %>

SELECT "priorities".* FROM "priorities"
---
    <%= form.label :priority %><br>
    <%= form.collection_select(:priority_id, Priority.all, :id, :name) %>

SELECT "types".* FROM "types"
---
    <%= form.label :category %><br>
    <%= form.collection_select(:type_id, Type.all, :id, :name) %>