app/views/tasks/show.html.erb

		<td><strong>End Date:</strong></td>
  		<td><%if @task.status.name == "Completed" && @task.end_date.present?%>
---
SELECT  "statuses".* FROM "statuses" WHERE "statuses"."id" = ? LIMIT ?  [["id", 31], ["LIMIT", 1]]