app/controllers/tasks_controller.rb

SELECT  "types".* FROM "types" WHERE "types"."id" = ? LIMIT ?  [["id", 41], ["LIMIT", 1]]
SELECT "tasks".* FROM "tasks" ORDER BY start IS NULL, due_date DESC
SELECT "tasks".* FROM "tasks" ORDER BY end_date IS NULL, due_date DESC
SELECT "tasks".* FROM "tasks"
---
	def index
  	#@tasks = Task.all
    if params[:type_search].present?
      type =  Type.find(params[:type_search])
      @tasks = type.tasks

    elsif params[:date_sort].present?
      item = params[:date_sort]
      if item == 'start'
        if params[:up_down] == 'asc'
          @tasks = Task.order('start IS NULL, due_date ASC')
        else
          @tasks = Task.order('start IS NULL, due_date DESC')
        end
      elsif item == 'due_date'
        if params[:up_down] == 'asc'
          @tasks = Task.order('due_date IS NULL, due_date ASC')
        else
          @tasks = Task.order('due_date IS NULL, due_date DESC')
        end
      else
        if params[:up_down] == 'asc'
          @tasks = Task.order('end_date IS NULL, due_date ASC')
        else
          @tasks = Task.order('end_date IS NULL, due_date DESC')
        end
      end


    else
      @tasks = Task.all

INSERT INTO "tasks" ("title", "description", "start", "due_date", "end_date", "created_at", "updated_at", "type_id", "status_id", "priority_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
		ActionController::Parameters.permit_all_parameters = true
		#render plain: params[:task].inspect
  	@task = Task.new(params[:task])

  	if @task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "tasks" SET "description" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["description", "buy austin or mustang. look for mercedes price"], ["updated_at", "2019-01-27 12:25:49.036970"], ["id", 17]]
---
  def update
    @task = Task.find(params[:id])

    if @task.update(params[:task])