app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("title", "description", "created_at", "updated_at", "type_id", "status_id", "priority_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", ""], ["description", ""], ["created_at", "2019-01-16 02:21:47.470888"], ["updated_at", "2019-01-16 02:21:47.470888"], ["type_id", 37], ["status_id", 31], ["priority_id", 19]]
---
	def create
		ActionController::Parameters.permit_all_parameters = true
		#render plain: params[:task].inspect
  		@task = Task.new(params[:task])

  		@task.save